/*************************************************************************
	> 文件名: test.cpp
	> 作者: 马海城
	> 邮箱: hchma@outlook.com
	> 创建日期: 2016年03月27日 星期日 09时41分45秒
 ************************************************************************/

#include <iostream>
using namespace std;

int main()
{
    int n = 0;
    float x = 1, y1 = 2.1 / 1.9, y2 = 1.9 / 2.1;

    for (int i = 1; i < 22; ++i)
        x = x * y1;

    while (x != 1.0)
    {
        x = x * y2;
        n++;
    }

    cout << n << endl;
}
